app/controllers/bands_controller.rb

SELECT * FROM "bands"
---
  def index
    @bands = Band.all

SELECT * FROM "bands" WHERE ("bands"."id" = 0)
---
  def show
    @band = Band.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def new
    @user = User.find(session[:user_id])

SELECT * FROM "bands" WHERE ("bands"."id" = 7)
---
  def edit
    @band = Band.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "bands" ("name", "created_at", "updated_at", "genre", "description") VALUES('the band', '2009-08-18 04:58:14', '2009-08-18 04:58:14', 'country', 'ya ay')
---
  def create
    @user = User.find(session[:user_id])
    @band = Band.new(params[:band])
#    @band.name = params[:band][:name]
#    @band.genre = params[:band][:genre]
#    @band.description = params[:band][:description]
    respond_to do |format|
      if @band.save

SELECT * FROM "bands" WHERE ("bands"."id" = 7)
UPDATE "bands" SET "updated_at" = '2009-08-18 18:37:54', "genre" = 'rock', "name" = 'dp fresh', "description" = 'funky stuff' WHERE "id" = 7
---
  def update
    @band = Band.find(params[:id])

    respond_to do |format|
      if @band.update_attributes(params[:band])

SELECT * FROM "bands" WHERE ("bands"."id" = 1)
DELETE FROM "bands" WHERE "id" = 1
---
  def destroy
    @band = Band.find(params[:id])
    @band.destroy