app/controllers/gigs_controller.rb

  def index
    @gigs = Gig.all
---
SELECT * FROM "gigs"

  def show
    @gig = Gig.find(params[:id])
    @venue = Venue.find_by_id(@gig.venue_id)
---
SELECT * FROM "gigs" WHERE ("gigs"."id" = 1)
SELECT * FROM "venues" WHERE ("venues"."id" = 1) LIMIT 1

  def new
    @user = User.find(session[:user_id])
    @gig = Gig.new
    @venue = @user.venues.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "venues" INNER JOIN "users_venues" ON "venues".id = "users_venues".venue_id WHERE ("venues"."id" = 1 AND ("users_venues".user_id = 1 ))

  def edit
    @gig = Gig.find(params[:id])
    @venue = Venue.find_by_id(@gig.venue_id)
    @band = Band.find_by_id(@gig.band_id)
---
SELECT * FROM "gigs" WHERE ("gigs"."id" = 7)
SELECT * FROM "venues" WHERE ("venues"."id" = 1) LIMIT 1
SELECT * FROM "bands" WHERE ("bands"."id" = 0) LIMIT 1

  def create
    @user = User.find(session[:user_id])
    @venue = Venue.find(params[:venue_id])

    @gig = Gig.new(params[:gig])
    @gig.venue_id = @venue.id
    @gig.band_id = '0'
    #@gig.date = Date.new(params[:time]['date(1i)'].to_i, params[:time]['date(2i)'].to_i, params[:time]['date(3i)'].to_i)
    #@gig.time = Time.new
    #@gig.time = @gig.time.change( :year  => params[:gig]['time(1i)'].to_s,
    #                              :month => params[:gig]['time(2i)'].to_s,
    #                              :day   => params[:gig]['time(3i)'].to_s,
    #                              :hour  => params[:gig]['time(4i)'].to_s,
    #                              :min   => params[:gig]['time(5i)'].to_s )

    respond_to do |format|
      if @gig.save
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "venues" WHERE ("venues"."id" = 1)
INSERT INTO "gigs" ("city", "updated_at", "time", "date", "venue_id", "event", "zip_code", "description", "street", "band_id", "state", "created_at") VALUES('goleta', '2009-09-02 16:46:23', '2000-01-01 16:00:00', NULL, 1, 'party', '93117', 'party time for bands.', '123', 0, 'ca', '2009-09-02 16:46:23')

  def update
    @gig = Gig.find(params[:id])

    respond_to do |format|
      if @gig.update_attributes(params[:gig])
---
SELECT * FROM "gigs" WHERE ("gigs"."id" = 8)
UPDATE "gigs" SET "updated_at" = '2009-09-04 21:13:43', "zip_code" = '93117', "city" = 'goleta', "state" = 'ca', "street" = '123', "description" = 'soho''s gig' WHERE "id" = 8

  def destroy
    @gig = Gig.find(params[:id])
    @gig.destroy
---
SELECT * FROM "gigs" WHERE ("gigs"."id" = 1)
DELETE FROM "gigs" WHERE "id" = 1