app/controllers/profile_controller.rb

SELECT * FROM "users" WHERE ("users"."screen_name" = 'foobar') LIMIT 1
---
  def show
    @hide_edit_links = true
    screen_name = params[:screen_name]
    @user = User.find_by_screen_name(screen_name)