app/controllers/spec_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "specs" SET "updated_at" = '2009-08-19 00:02:49', "birthdate" = '1917-04-04', "zip_code" = '93117', "city" = 'goleta', "bio" = 'Funky Ninja.', "state" = 'ca', "last_name" = 'Bellotti', "gender" = 'Male', "first_name" = 'Dave', "occupation" = 'president' WHERE "id" = 1
---
  def edit
    @title = "Edit Spec"
    @user = User.find(session[:user_id])
    @user.spec ||= Spec.new
    @spec = @user.spec
    if param_posted?(:spec)
      if @user.spec.update_attributes(params[:spec])