app/controllers/user_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2)
SELECT * FROM "gigs" WHERE ("gigs".venue_id = 1)
---
  def index
    @title = "Musigigs User Hub"
    @user = User.find(session[:user_id])
    @spec = @user.spec ||= Spec.new
    @bands = @user.bands
    @venues = @user.venues
    @gigs = Gig.all

INSERT INTO "users" ("created_at", "updated_at", "password", "screen_name", "email", "authorization_token") VALUES('2009-08-15 02:29:47', '2009-08-15 02:29:47', 'test', 'davebot', 'dave@yahoo.com', NULL)
---
  def register
    @title = "Register"
    if param_posted?(:user)
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM "users" WHERE ("users"."screen_name" = 'foobar' AND "users"."password" = 'bazquux') LIMIT 1
---
  def login
    @title = "Log in to Musigigs"
    if request.get?
      @user = User.new(:remember_me => remember_me_string)
    elsif param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_screen_name_and_password(@user.screen_name, @user.password)

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def edit
    @title = "Edit basic info"
    @user = User.find(session[:user_id])