app/controllers/venues_controller.rb

  def index
    @venues = Venue.all
---
SELECT * FROM "venues"

  def show
    @venue = Venue.find(params[:id])
---
SELECT * FROM "venues" WHERE ("venues"."id" = 1)

  def new
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)

  def edit
    @venue = Venue.find(params[:id])
---
SELECT * FROM "venues" WHERE ("venues"."id" = 2)

  def create
    @user = User.find(session[:user_id])
    @venue = Venue.new(params[:venue])

    respond_to do |format|
      if @venue.save
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
INSERT INTO "venues" ("name", "city", "created_at", "zip_code", "updated_at", "street", "description", "state") VALUES('soho', 'santa barbara', '2009-08-21 17:58:52', '92679', '2009-08-21 17:58:52', '123', 'Cool local venue..', 'ca')

  def update
    @venue = Venue.find(params[:id])

    respond_to do |format|
      if @venue.update_attributes(params[:venue])
---
SELECT * FROM "venues" WHERE ("venues"."id" = 1)
UPDATE "venues" SET "updated_at" = '2009-08-25 01:10:29', "zip_code" = '92679', "city" = 'santa barbara', "state" = 'ca', "street" = '123', "description" = 'cool venue' WHERE "id" = 1

  def destroy
    @venue = Venue.find(params[:id])
    @venue.destroy
---
SELECT * FROM "venues" WHERE ("venues"."id" = 2)
DELETE FROM "venues" WHERE "id" = 2